#დავალება 1

Favorite_Food= "Khinkali"
print(Favorite_Food)

# ჯერ ცვლადს მივეცი მნიშვნელობა შემდეგ კი დავპრინტე ის

#დავალება 2

print(8+11)

print(10-4)

print(14+2)

print(2*2)

print(15//3)


#დავალება 3

age=15
day=4

print(age-day)

print(age+day)

print(age*day)

print(age/day)


#სავარჯიშოები
#1 პასუხი: ბ) dog_name

#2 პასუხი: case sensative ენა ნიშნავს იმას რომ უნდა დავუკვირდეთ დიდ და პატარა ასოებს, რადგან პითონი მათ
#- განსხვავებულად აღიქვამს მაგალითად: თუ დავწერთ "name = dito"-ს და პრინტში დავწერთ " print(Name)"-ს იქნება error რადგან დავწერეთ Name და არა name.

#3 პასუხი: პითონში ჩვენ უნდა დავარქვათ ცვლადებს შესაბამისი სახელები მაგ: age=15. რადგან გასაგები იყოს იმისთვის ვინც კოდს წაიკითხავს.
# ასევე ჩვენ უნდა გავაკეთოთ კომენტარები კოდის წერისას რომ უფრო ადვილად გასაგები იყოს რას აკეთებ.





