#დავალება 5

# Input არის როცა მოწყობილობა ინფორმაციას იღებს მომხმარებლისგან ან სხვა რაიმე წყაროსგან
# Input მაგალითები: როცა ჩვენ ვწერთ კლავიატურით ან ვიყენებთ მაუსს.

# Output არის როცა მოწყობილობიდან გამოდის რაიმე სახის ინფორმაცია 
# მაგალითად როცა პრინტერი ბეჭდავს რამეს ფურცელზე, როცა მონიტორზე ვხედავთ გამოსახულებას.

# ჩვენ ვიცით ბევრი კარგი პრაქტიკები მაგალითად
# 1. ცვლადებს დავარქვათ მისთვის შესაბამისი სახელები მაგ: city='London'
# 2. კომენტარებით ავხსნათ კოდი რათა გაადვილდეს მისი წაკითხვა ჩვენთვის და სხვებისთვისაც.
# 3. გამოვიყენოთ ცვლადები და არ ჩავსვათ მონაცემები პირდაპირ
