# 5. კომენტარების მეშვეობით ახსენი, რა არის for loop, რა არის while loop, რა განსხვავებაა მათ შორის და რა დროს რომლის გამოყენება სჯობს.


# for loop არის ციკლი რომელსაც ვიყენებთ ერთი და იგივე კოდის მრავალჯერ გამოტანისთვის. for loop-ს იმ შემთხვევაში ვიყენებთ როცა ვიცით კოდის გამოტანა რამდენჯერ გვინდა.

# while loop ჰგავს for loops მაგრამ while loop-ში არ არის განსაზღვრული რამდენჯერ გვინდა კოდის გამოტანა და იქამდე მუშაობს სანამ რაღაც პირობა არ დაირღვევა.

# for loop-ის გამოყენება ჯობია მაშინ როცა ვიცით რამდენჯერ უნდა გამოვიყენოთ კოდი, while loop კი იმ შემთხვევაში უნდა გამოვიყენოთ როცა არ ვიცით რამდენჯერ მოგვიწევს კოდის გამოყენება.