# 1. შექმენით სია, სადაც გექნებათ 7 სიტყვა, შემდეგ:

#          0      1            2      3        4        5        6
names = ['dito','achiko', 'sandro','girogi','aleqsi','irakli','revazi']


# * დადებითი ინდექსინგის მეშვეობით გამოიტანეთ მეორე და მესამე სიტყვა.

print(names[1:3])


# * დადებითი ინდექსინგის მეშვეობით გამოიტანეთ მეხუთედან ყველა სიტყვა ბოლომდე.

print(names[4:])


# * უარყოფითი ინდექსინგის მეშვეობით გამოიტანეთ მეორე და მესამე სიტყვა.

print(names[-6:-4])



# * უარყოფითი ინდექსინგის მეშვეობით გამოიტანეთ მეხუთედან ყველა სიტყვა ბოლომდე.

print(names[-3:])


# * უაყოფითი და დადებითი ინდექსინგის, ორივეს მეშვეობით, გამოიტანეთ მესამე ელემენტიდან მეექსვეს ჩათვლით ყველა

print(names[2:-1])


# * გამოიტანეთ სიის ყველა ელემენტი, დადებითი ინდექსინგის მეშვეობით.

print(names[0:6])